{
  "logo": [
    {
      "id": 1,
      "logoImgurl": "/images/home/logo3.png"
    }
  ],
  "direction": [
    {
      "id": 1,
      "img": "/images/home/right-arrow.png",
      "img1": "/images/home/left-arrow.png"
    }
  ],
  "HomePage": [
    {
      "id": 1,
      "carouselImg1": "/images/home/HematiteAnniversaryBanner.jpg",
      "carouselImg2": "/images/home/carousel3.jpg",
      "carouselImg3": "/images/home/carousel1.jpg",
      "carouselImg4": "/images/home/carousel2.jpg",
      "title": "Best Online & Offline Institute",
      "tagline1": "Master IT Skills",
      "tagline2": "Transform Your Future in",
      "tagline3": "IT with Our Expertise",
      "carouselBanners": [
        "/images/home/HematiteAnniversaryBanner.jpg",
        "/images/home/carousel3.jpg",
        "/images/home/carousel1.jpg",
        "/images/home/carousel2.jpg"
      ]
    }
  ],
  "offerImg": [
    {
      "id": 1,
      "img": "/images/offers/hematite_latest_offer_230824.jpg"
    }
  ],
  "homepageabout": [
    {
      "id": 1,
      "aboutImageurl": "images/home/about_section_img.jpg",
      "description1": "Hematite Infotech Pvt. Ltd., established in 2017, is dedicated to the spread of IT education and the transformation of aspiring students into tomorrow’s IT professionals. Our Academy focuses on advanced information technologies, high-end academics, and comprehensive training. Our distinguished faculty, complemented by expert and visiting lecturers, delivers a range of educational activities including video sessions, seminars, internships, projects, and guidance in hackathons and start-ups. We also provide robust placement assistance, maintaining an enviable placement record since our inception.",
      "description2": "In addition to IT education, Hematite Infotech offers IT training, consulting, corporate training, application development, and digital marketing services. Our young team of technology experts is committed to providing the best solutions to our customers. "
    }
  ],
  "services": [
    {
      "id": 1,
      "icon": "MdComputer",
      "title": "Application Development",
      "description": "Our IT training programs are designed to equip individuals with the necessary skills and knowledge to excel in these specialized areas of programming. With a focus on hands-on learning and practical application, our courses cover the latest industry trends and technologies, allowing participants to stay ahead in this rapidly evolving field. Whether you are a beginner or an experienced professional, our comprehensive training programs can help you enhance your proficiency and achieve your career goals in IT development.",
      "iconUrl": "images/services/html.png"
    },
    {
      "id": 2,
      "title": "IT Training",
      "description": "Our comprehensive IT training programs cover a wide range of in-demand skills and technologies. Whether you're interested in mastering DevOps methodologies, becoming a proficient web developer, or delving into the world of Artificial Intelligence with Python and Machine Learning, we have the courses to suit your needs. Additionally, we offer training in Mobile App Development for both Android and iOS platforms, as well as expertise in ASP.NET, Java (Core + Advanced), software testing, cloud computing, CCNA networking, and effective business communication strategies ",
      "iconUrl": "images/services/training.png"
    },
    {
      "id": 3,
      "title": "IT Consulting",
      "description": "Hematite Consultants advises on the technology enablement, Application security and process enablement for Organizations. Our specialized consultants help minimize the cost and time associated transformative changes in the business of IT. Primary client offerings include Management Consulting, IT Strategic Services, Project Leadership, Data Analytics, and Information Management, Application security consultants, Network engineers, Software Technology consultants.",
      "iconUrl": "images/services/strategic-consulting.png"
    }
  ],
  "contact": [
    {
      "id": "1",
      "address": "Pune: 2nd Floor, Mathura Nagar Housing Society, Near Janseva Sahakari Bank Chandan Nagar, Kharadi, Pune - 411014.",
      "mobile": "8263926309 / 8999639478",
      "email": "contact@hematitecorp.com",
      "maplink": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3782.301558443656!2d73.92858157393674!3d18.56043856795771!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3bc2c1efd084fb8b%3A0x1f8e0c9fe165aea4!2sHematite%20Infotech%20IT%20Training%20%26%20Placement%20Institute!5e0!3m2!1sen!2sin!4v1724058927815!5m2!1sen!2sin"
    }
  ],
  "placementcontent": [
    {
      "id": "1",
      "title": "Training and Placement Process",
      "placementDescription": [
        "Hematite Infotech Pvt Ltd has a dedicated placement team that provides students with daily job notifications, ensuring continuous opportunities for career advancement. While the Training and Placement cell facilitates placement activities, it does not guarantee a job.",
        "However, we are committed to preparing students for success through a structured process:"
      ],
      "placementRules": [
        {
          "title": "Course Completion",
          "description": "Students must complete their course with at least 80% attendance."
        },
        {
          "title": "Skill Tests",
          "description": "Passing mid-course tests is a requirement."
        },
        {
          "title": "Mock Interviews",
          "description": "Participation in both HR and technical mock interviews is essential."
        },
        {
          "title": "Project Submission",
          "description": "Completion and submission of two projects, along with presentations, is mandatory"
        },
        {
          "title": "Faculty Review",
          "description": "Projects must be reviewed and approved by a faculty member."
        },
        {
          "title": "CV Submission",
          "description": "An updated CV must be submitted to advance in the placement process"
        },
        {
          "title": "Fee Clearance",
          "description": "Both payment installments must be settled before participating in the placement drive, after the syllabus and project work are completed."
        },
        {
          "title": "Stay Connected",
          "description": "Students are responsible for maintaining regular communication with the Training and Placement Coordinators through the provided email for updates on placement matters."
        }
      ],
      "placementPhotos": [
        "images/placement/infrastructure_17.jpeg",
        "images/placement/infrastructure_16.jpeg"
      ]
    }
  ],
  "courses": [
    {
      "id": "1",
      "isActive": true,
      "cardimg": "images/courses/tiles/GraphicDesign.png",
      "bannerImgurl": "images/courses/banners/GraphicDesign.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Graphic Design",
      "upcomingbatch": true,
      "registrationStart": "28-08-2024",
      "registrationEnd": "11-09-2024",
      "price": {
        "originalprice": "18000",
        "offerprice": "15000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Fundamental principles and methodologies of graphic design.",
              "Techniques for creating compelling visual content using color theory, typography, and composition.",
              "Proficiency in Adobe Creative Suite tools: CorelDraw, Photoshop, Illustrator, and InDesign.",
              "Designing for different media: print, web, and mobile.",
              "Basics of branding and visual identity.",
              "Understanding and applying design thinking in projects."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No prior knowledge about graphic design required.",
              "Basic computer skills."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Graphic design is the art and practice of planning and projecting ideas and experiences with visual and textual content. This course covers a range of design disciplines and focuses on how to communicate ideas visually, how to develop a design process, and how to use different design tools and software effectively. The course aims to help learners develop the skills necessary to create visually appealing designs that meet professional standards."
          ]
        },
        "syllabus": [
          {
            "title": "Graphic Design",
            "contents": [
              {
                "title": "Introduction to Graphic Design",
                "description": "Understanding the role and importance of graphic design in various fields."
              },
              {
                "title": "CorelDraw",
                "description": "Creating vector graphics, logos, and illustrations."
              },
              {
                "title": "Design Principles",
                "description": "Learning the core principles of design such as balance, contrast, alignment, repetition, and proximity."
              },
              {
                "title": "Color Theory",
                "description": "Exploring the psychological effects of colors and how to use them effectively in design."
              },
              {
                "title": "Typography",
                "description": "Understanding typefaces, fonts, and how to create readable and aesthetically pleasing text layouts."
              },
              {
                "title": "Adobe Photoshop",
                "description": "Basic and advanced photo editing techniques, working with layers, masks, and filters."
              },
              {
                "title": "Adobe Illustrator",
                "description": "Creating vector graphics, logos, and illustrations."
              },
              {
                "title": "Adobe InDesign",
                "description": "Designing layouts for print and digital publications."
              },
              {
                "title": "Branding and Visual Identity",
                "description": "Creating logos, brand guidelines, and visual identities that communicate the brand message."
              },
              {
                "title": "Portfolio Development",
                "description": "Compiling and presenting a professional design portfolio."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "People who want to begin a new career in graphic design.",
              "Individuals looking to learn graphic design from scratch.",
              "Marketing and communication professionals who want to add design skills to their toolkit.",
              "Freelancers looking to enhance their design skills and offer more services to clients.",
              "Artists and creative professionals who want to explore the digital side of design."
            ]
          }
        ]
      }
    },
    {
      "id": "2",
      "isActive": true,
      "cardimg": "images/courses/tiles/PythonWithDjango.png",
      "bannerImgurl": "images//courses/banners/PythonDjango.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "60 days",
      "title": "Python with Django",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "22000",
        "offerprice": "18000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Learn Django basics, including project creation, model understanding, migrations, and local server deployment.",
              "Implement a full Models-Views-Templates structure for your site",
              "Handle form submission POST requests and save data to the database.",
              "Implement authentication and authorization in Django web applications.",
              "Construct REST APIs using Django Rest Framework.",
              "Fundamentals of SQL including syntax, keywords, and statements.",
              "Principles of database design, normalization, and entity-relationship modeling.",
              "Operations like inserting, updating, deleting, and querying data in MySQL tables.",
              "Writing complex SQL queries with joins, subqueries, and aggregate functions."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Basic Python and web development knowledge (HTML/CSS).",
              "No prior Django experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "title": "Course Description",
          "description": [
            "Django is a Python web framework known for its rapid development and pragmatic design. It simplifies web app development with features like URL routing, database management, form handling, and template rendering.",
            "Django REST Framework (DRF) extends Django's capabilities to create robust APIs, offering tools for data serialization, authentication, permissions, and viewsets, catering to web and mobile app needs. It's a key tool for developing modern web applications with Django and Python.",
            "MySQL is a widely used relational database management system (RDBMS) that seamlessly integrates with Django, a high-level Python web framework. Django provides built-in support for MySQL, allowing developers to efficiently create web applications that interact with MySQL databases."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Introduction",
                "description": "Overview of Python, its features, and internal workings."
              },
              {
                "title": "Variables & Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators",
                "description": "Overview of arithmetic, comparison, logical, and bitwise operators."
              },
              {
                "title": "Control Flow",
                "description": "Conditional statements (if, elif) and loops (for, while) for decision-making and iteration."
              },
              {
                "title": "Functions & Recursion",
                "description": "Defining, calling functions, function arguments, inner calling techniques, lambda functions, and recursive functions."
              },
              {
                "title": "Input Handling",
                "description": "Managing dynamic input in lists using list comprehension and the input() function."
              },
              {
                "title": "Object-Oriented Programming (OOP)",
                "description": "Introduction to classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators & Concurrency",
                "description": "Understanding decorators to enhance functions and methods, and working with multiprocessing and multithreading for concurrency."
              }
            ]
          },
          {
            "title": "MySQL",
            "contents": [
              {
                "title": "Introduction to RDBMS",
                "description": "Understand the fundamentals of Relational Database Management Systems."
              },
              {
                "title": "Installation of MySQL",
                "description": "Learn how to install and set up MySQL on your system."
              },
              {
                "title": "Data Retrieval",
                "description": "Master the SELECT statement for retrieving data from tables."
              },
              {
                "title": "Data Manipulation",
                "description": "Explore techniques for adding and modifying data with INSERT INTO and UPDATE statements."
              },
              {
                "title": "Advanced Operations",
                "description": "Gain proficiency in list filtering (IN & NOT IN), sorting (ORDER BY), joins (INNER, LEFT, RIGHT), union operations, aggregate functions (SUM, ROUND, GROUP BY, HAVING), database and table management (CREATE, DROP, ALTER), constraints, date handling, SQL data types, and MySQL functions."
              }
            ]
          },
          {
            "title": "MongoDB",
            "contents": [
              {
                "title": "Basics of NoSQL Databases",
                "description": " Learn the fundamental concepts of NoSQL databases, highlighting the differences from traditional SQL databases."
              },
              {
                "title": "Installation and Setup",
                "description": " Guide through installing MongoDB and setting up the development environment."
              },
              {
                "title": "Data Modeling",
                "description": "Understand how to design and manage data structures using collections and documents."
              },
              {
                "title": "CRUD Operations",
                "description": " Perform Create, Read, Update, and Delete operations in MongoDB."
              },
              {
                "title": "Mongoose",
                "description": "Learn how to use Mongoose, an ODM (Object Data Modeling) library, to interact with MongoDB in a Node.js application for schema definition, data validation, and query building."
              }
            ]
          },
          {
            "title": "Django",
            "contents": [
              {
                "title": "Introduction & Installation",
                "description": "Basics and installing Django."
              },
              {
                "title": "URLs & Views",
                "description": "Routing URLs to views."
              },
              {
                "title": "Redirects & Reverse",
                "description": "Handling redirects and generating URLs dynamically."
              },
              {
                "title": "Templates & Static Files",
                "description": "Preparing and rendering templates, managing templates and static files."
              },
              {
                "title": "Styling & Static URLs",
                "description": "Adding CSS styling and dynamic static URLs."
              },
              {
                "title": "Data & Models",
                "description": "Defining models, managing migrations and working with data and database options."
              },
              {
                "title": "Data Operations",
                "description": "Inserting, updating, querying, and filtering data."
              },
              {
                "title": "Admin & Relationships",
                "description": "Using the admin interface and defining model relationships."
              },
              {
                "title": "Forms & Class Views",
                "description": "Implementing forms and views using classes."
              },
              {
                "title": "File Uploads & REST API",
                "description": "Handling file uploads and using Django Rest Framework for APIs."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Anyone interested in learning website development with Python.",
              "Intermediate programmers who already have some understanding of Python and want to skill up.",
              "Developers interested in understanding how to create and manage APIs."
            ]
          }
        ]
      }
    },
    {
      "id": "3",
      "isActive": true,
      "cardimg": "images/courses/tiles/Python.png",
      "bannerImgurl": "images/courses/banners/Python.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "45 days",
      "title": "Python",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "10000",
        "offerprice": "8000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "4",
      "isActive": true,
      "cardimg": "images/courses/tiles/DataVisualization.png",
      "bannerImgurl": "images/courses/banners/DataVisualization.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Data Visualization",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "18000",
        "offerprice": "16500",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Integrate various data sources into Power BI and Tableau, including CSV files, SQL databases, and cloud storage services.",
              "Understand relationships, cardinality, and schema types (Star and Snowflake) in Power BI data modeling.",
              "Create dashboards in Power BI and Tableau to effectively communicate data insights through visual storytelling.",
              "Use DAX functions in Power BI and calculated fields in Tableau for sophisticated data manipulation and insight generation.",
              "Apply filtering and sorting techniques in Power BI and Tableau for focused and precise data exploration.",
              "Gain skills in saving, sharing, and presenting data visualizations in professional formats using Power BI and Tableau."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No prior knowledge of data visualization required.",
              "No programming skills required"
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Data visualization is the graphical representation of data to communicate insights and patterns effectively. By converting complex data into visual formats such as charts, graphs, and maps, data visualization allows for easier interpretation, analysis, and decision-making. It enables users to uncover trends, correlations, and outliers in data sets, making it an essential tool across various industries, including business, science, and academia."
          ]
        },
        "syllabus": [
          {
            "title": "POWER BI",
            "contents": [
              {
                "title": "Introduction to Power BI",
                "description": "Overview of tools, installation, data import, and understanding Direct Query vs. Import Data."
              },
              {
                "title": "Data Transformation",
                "description": "Using Power Query Editor for data manipulation, including column adjustments, appending, merging queries, creating tables, and using query parameters."
              },
              {
                "title": "Modeling with Power BI",
                "description": "Basics of data modeling, managing relationships, cardinality, cross-filtering, hierarchies, calculated columns, measures, and quick measures."
              },
              {
                "title": "Power BI Visualization",
                "description": "Creating charts and visuals, applying formatting, filters, advanced techniques like drill down/up, managing visuals, and custom report themes."
              },
              {
                "title": "DAX Functions and Publishing",
                "description": "Introduction to DAX, data types, operators, advanced DAX usage, function types, sharing, publishing reports, and using collaborative tools."
              }
            ]
          },
          {
            "title": "TABLEAU",
            "contents": [
              {
                "title": "Introduction to Tableau",
                "description": "Overview of Tableau tools and interface, data connection, and preparation."
              },
              {
                "title": "Data Connections and Preparation",
                "description": "Connecting to various data sources, blending data, managing extracts, and joining data."
              },
              {
                "title": "Data Transformation",
                "description": "Tableau's data organization, applying filters, creating groups, and calculated fields."
              },
              {
                "title": "Visual Analytics",
                "description": "Creating basic and advanced charts, geospatial visualization, trend lines, and reference lines."
              },
              {
                "title": "Dashboards and Stories",
                "description": "Designing interactive dashboards, adding actions and filters, and creating compelling data stories."
              },
              {
                "title": "Sharing and Collaboration",
                "description": ":Publishing to Tableau Server and Online, sharing workbooks, and using collaborative features."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Programmers, researchers, designers, data scientists, journalists, and communication experts who need to present data effectively.",
              "MS Excel users who have basic skills but want to master advanced charts, graphs & dashboard.",
              "Anyone interested in understanding how graphs work and learning to identify misleading visualizations.",
              "Professionals across industries aiming to enhance data analysis skills",
              "Students in data science or business analytics fields seeking to expand their skills"
            ]
          }
        ]
      }
    },
    {
      "id": "5",
      "isActive": true,
      "cardimg": "images/courses/tiles/ReactJS.png",
      "bannerImgurl": "images/courses/banners/ReactJs.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "React JS",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "22000",
        "offerprice": "18000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Gain comprehensive knowledge to become a proficient React developer, covering basics to advanced concepts.",
              "Understand core fundamentals including Components & Props, State, Hooks, Context & Reducers, and more.",
              "Effectively manage complex state with React's Context API & React Redux.",
              "Create standalone React apps and backend-connected applications via HTTP.",
              "Learn routing and route-related data fetching with React Router.",
              "Begin React Unit Testing for robust applications."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "NO React experience necessary! I take you from beginner to expert!.",
              "Basic understanding of JavaScript is required (this course contains a quick JavaScript review section).",
              "Any computer and OS will work — Windows, macOS or Linux."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "This React course teaches the fundamentals of building dynamic web applications using React.js, including components, state, hooks, and modern JavaScript (ES6). Learners will also explore advanced topics like state management with Redux, routing with React Router, and handling asynchronous data. Practical projects and hands-on exercises prepare students to build efficient, scalable applications and become proficient React developers."
          ]
        },
        "syllabus": [
          {
            "title": "React JS",
            "contents": [
              {
                "title": "Why Use It",
                "description": "Efficient rendering, component-based architecture, virtual DOM, and easy integration."
              },
              {
                "title": "Webpack",
                "description": "A module bundler that handles assets and dependencies, converts files into browser-compatible formats, and manages images and styles."
              },
              {
                "title": "Modern JavaScript Syntax (ES6)",
                "description": "Key syntax features like Classes, Properties, Functions, and Arrow Functions crucial for React development."
              },
              {
                "title": "Component Class and Propertie",
                "description": "Define stateful and stateless components."
              },
              {
                "title": "React APIs",
                "description": "Methods like createClass and createElement."
              },
              {
                "title": "Render Method",
                "description": "Renders components to the DOM."
              },
              {
                "title": "State and Props",
                "description": "Manage internal (state) and external (props) data of components."
              },
              {
                "title": "JSX",
                "description": "HTML-like syntax for creating React elements."
              },
              {
                "title": "React Events",
                "description": "Handle DOM and synthetic events."
              },
              {
                "title": "React Forms",
                "description": " Manage form inputs, submissions, validations, and component state."
              },
              {
                "title": "Component Lifecycle Methods",
                "description": "Manage components during mounting, updating, and unmounting."
              },
              {
                "title": "Parent-Child Components",
                "description": "Facilitate data and event passing between components."
              },
              {
                "title": "React Router",
                "description": "Manage navigation and routing within the application."
              },
              {
                "title": "Async/Await",
                "description": " A modern approach for managing asynchronous operations."
              },
              {
                "title": "FLUX Architecture",
                "description": "Manages unidirectional data flow in React applications."
              },
              {
                "title": "Redux Store",
                "description": " Centralized state management; dispatch actions to update the store."
              },
              {
                "title": "Redux Actions",
                "description": " Functions that describe state changes."
              },
              {
                "title": "Redux Reducers",
                "description": " Pure functions that update the state based on actions."
              },
              {
                "title": "Injecting Redux Store",
                "description": "Pass the Redux store to the React application via the Provider component."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "You just finished learning JavaScript and are looking for your next step!",
              " You want to truly master React development, including common libraries needed to build real-world apps: React Router, Redux, React Query, Next..js, and many others.",
              "You have been learning React, but 1) still don't understand React, or 2) still don't feel confident to build professional React apps.",
              " You have been building React apps, but are still missing the advanced stuff: useReducer, performance optimization, how React actually works, advanced design patterns, etc."
            ]
          }
        ]
      }
    },
    {
      "id": "6",
      "isActive": true,
      "cardimg": "images/courses/tiles/SoftwareTesting.png",
      "bannerImgurl": "images/courses/banners/SoftwareTesting.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Software Testing",
      "upcomingbatch": true,
      "registrationStart": "28-08-2024",
      "registrationEnd": "11-09-2024",
      "price": {
        "originalprice": "16000",
        "offerprice": "14000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understanding the fundamental principles and methodologies of software testing.",
              "Techniques for creating detailed test cases and documenting bug reports effectively.",
              "Equivalence partitioning, boundary value analysis, decision table testing, and state transition testing.",
              "How to use JIRA for project and issue tracking.",
              "Statement coverage, decision coverage, condition coverage, path coverage, MCDC, loop coverage.",
              "Introduction to API testing principles and how to use Postman for API testing.",
              "Basics of performance testing using JMeter."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No prior knowledge about the field required."
            ]
          }
        ],
        "courseDescription": {
          "title": "Course Description",
          "description": [
            "Software testing is the process of evaluating and verifying that a software application or system meets specified requirements and functions correctly. It involves various methods and techniques, such as manual and automated testing, unit testing, integration testing, system testing, and acceptance testing. The goal is to identify defects, ensure quality, and improve the performance, security, and usability of the software. Effective software testing is essential for delivering reliable and high-quality software products."
          ]
        },
        "syllabus": [
          {
            "title": "Software Testing",
            "contents": [
              {
                "title": "Functional and Non-Functional Testing",
                "description": "Different types of testing and their significance."
              },
              {
                "title": "Defect Management",
                "description": "Creating and managing defect report sheets."
              },
              {
                "title": "Mobile Testing",
                "description": "Using Appium for mobile application testing."
              },
              {
                "title": "API Testing",
                "description": "Proficiency in API testing with Postman."
              },
              {
                "title": "Database Testing",
                "description": "SQL skills for effective database testing."
              },
              {
                "title": "Core Selenium",
                "description": "In-depth coverage of Selenium IDE, Grid, and WebDriver."
              },
              {
                "title": "Java Basics",
                "description": "Essential Java programming knowledge for testers."
              },
              {
                "title": "Testing Frameworks",
                "description": "Implementing TestNG, Maven, and generating Extent Reports."
              },
              {
                "title": "JIRA Tool",
                "description": "Architecture, installation, project creation, user management, dashboard and gadgets customization, and exploring the Atlassian Marketplace."
              },
              {
                "title": "JMeter",
                "description": "Introduction to JMeter elements, building test plans, recording tests, running multiple scripts, and using functions, variables, and regular expressions."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "People who want to begin a new career in software testing.",
              "Individuals looking to learn software testing from scratch.",
              "IT professionals who want to learn about software testing.",
              "Software testers looking to deepen their understanding of software testing."
            ]
          }
        ]
      }
    },
    {
      "id": "7",
      "isActive": true,
      "cardimg": "images/courses/tiles/Angular13+.png",
      "bannerImgurl": "images/courses/banners/Angular13+.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Angular 13+",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "22000",
        "offerprice": "18000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Learn Angular's evolution, set up Node.js, npm, and Angular CLI, and understand TypeScript essentials.",
              "Create reusable components, manage data flow, and master template syntax with data binding.",
              "Manage business logic with services, implement secure routing, and develop template-driven and reactive forms.",
              "Handle HTTP operations, manage state with NgRx, organize applications with modules, and optimize with lazy loading.",
              "Create custom directives/pipes, apply skills in real-world projects, and enhance UI with Angular Material."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Proficiency in HTML, CSS, JS & TS is crucial for understanding and working effectively with Angular.",
              "Basic computer and mobile skills are necessary for participating in the course."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Learn Angular 13+, the latest version of Google's web framework, to build dynamic, high-performance applications. This course covers essential features, including component-based architecture, state management, and routing, with a focus on creating modern Single Page Applications (SPAs) and Progressive Web Apps (PWAs)."
          ]
        },
        "syllabus": [
          {
            "title": "Angular 13+",
            "contents": [
              {
                "title": "Introduction to Angular",
                "description": "Understand the framework's core concepts, its evolution, and how it compares to other frameworks."
              },
              {
                "title": "Environment Setup",
                "description": "Learn to install and configure Node.js, npm, and Angular CLI. Create and manage Angular projects effectively."
              },
              {
                "title": "TypeScript Basics",
                "description": "Get up to speed with TypeScript, the primary language for Angular development, and learn essential syntax and features."
              },
              {
                "title": "Component-Based Architecture",
                "description": "Build reusable components, understand lifecycle hooks, manage data with Input and Output properties, and apply view encapsulation."
              },
              {
                "title": "Template Syntax and Data Binding",
                "description": "Master Angular's powerful template syntax, explore various data binding techniques, and use built-in directives and pipes."
              },
              {
                "title": "Services and Dependency Injection",
                "description": "Create services to manage business logic and data, and understand Angular's Dependency Injection system."
              },
              {
                "title": "Routing and Navigation",
                "description": " Implement robust routing solutions, configure routes, handle navigation, and secure your applications with guards and resolvers."
              },
              {
                "title": "Forms Handling",
                "description": "Develop both template-driven and reactive forms, implement validation, and create custom form controls."
              },
              {
                "title": "HTTP Client Integration",
                "description": "Communicate with backend services, handle HTTP responses and errors, and use interceptors to manage requests and responses."
              },
              {
                "title": "State Management with NgRx",
                "description": "Learn to manage application state with NgRx, including store setup, actions, reducers, effects, and selectors."
              },
              {
                "title": "Modular Development",
                "description": " Organize your application using Angular modules, and implement lazy loading for performance optimization."
              },
              {
                "title": "Custom Directives and Pipe",
                "description": "Extend Angular's capabilities by creating custom directives and pipes for specialized behaviour and data transformation."
              },
              {
                "title": "Real-World Application Development",
                "description": "Apply your skills in a practical project, from planning and implementation to testing and deployment."
              },
              {
                "title": "Further Learning and Resources",
                "description": "Access additional resources, stay updated with the latest Angular trends, and integrate useful third-party libraries and tools."
              },
              {
                "title": "Angular Materia",
                "description": "Use Angular Material for UI components."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Beginners who are starting their Angular and front-end development journey.",
              "Intermediate Developers wanting to learn the latest Angular features.",
              " Experienced Developers seeking to master Angular's advanced capabilities.",
              " Front-end Developers aiming to create scalable and maintainable web applications."
            ]
          }
        ]
      }
    },
    {
      "id": "8",
      "isActive": false,
      "cardimg": "images/courses/tiles/AdvanceExcel.png",
      "bannerImgurl": "images/courses/banners/AdvanceExcel.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "45 days",
      "title": "Advance Excel",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "6000",
        "offerprice": "5000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "9",
      "isActive": false,
      "cardimg": "images/courses/tiles/DataScience.png",
      "bannerImgurl": "images/courses/banners/DataScience.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "150 days",
      "title": "Data Science",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "47000",
        "offerprice": "45000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "10",
      "isActive": true,
      "cardimg": "images/courses/tiles/DigitalMarketing.png",
      "bannerImgurl": "images/courses/banners/DigitalMarketing.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Digital Marketing",
      "upcomingbatch": true,
      "registrationStart": "28-08-2024",
      "registrationEnd": "11-09-2024",
      "price": {
        "originalprice": "18000",
        "offerprice": "15000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understanding the fundamental principles and methodologies of digital marketing.",
              "Techniques for creating detailed marketing strategies and documenting campaign performance effectively.",
              "Search Engine Optimization (SEO), Pay-Per-Click (PPC) advertising, content marketing, and email marketing.",
              "How to use Google Analytics for tracking and analyzing website traffic.",
              "Social media marketing strategies across platforms like Facebook, Instagram, LinkedIn, and Twitter.",
              "Introduction to influencer marketing principles and how to leverage influencers for brand promotion.",
              "Basics of affiliate marketing and how to set up an affiliate program."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No prior knowledge about the field required",
              "Basic computer & mobile using skills"
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Digital marketing is the process of promoting products or services through digital channels to reach and engage with a targeted audience. It involves various methods and techniques such as search engine optimization (SEO), social media marketing, content marketing, email marketing, and pay-per-click (PPC) advertising. The goal is to create effective online marketing strategies that increase brand awareness, drive website traffic, and generate leads and conversions. Effective digital marketing is essential for building a strong online presence and achieving business growth."
          ]
        },
        "syllabus": [
          {
            "title": "Digital Marketing",
            "contents": [
              {
                "title": "Fundamentals of Digital Marketing",
                "description": "Overview of digital marketing concepts and strategies."
              },
              {
                "title": "SEO and SEM",
                "description": "Techniques for optimizing websites for search engines and managing search engine marketing campaigns."
              },
              {
                "title": "Content Marketing",
                "description": "Creating and distributing valuable content to attract and engage your target audience."
              },
              {
                "title": "Social Media Marketing",
                "description": "Leveraging social media platforms to promote your brand and interact with customers."
              },
              {
                "title": "Email Marketing",
                "description": "Building and managing email lists, creating email campaigns, and analyzing their performance."
              },
              {
                "title": "Google Analytics",
                "description": "Setting up and using Google Analytics to measure website performance and user behavior."
              },
              {
                "title": "PPC Advertising",
                "description": "Understanding Google Ads, creating PPC campaigns, and optimizing for better ROI."
              },
              {
                "title": "Influencer Marketing",
                "description": "Identifying and partnering with influencers to expand your reach and credibility."
              },
              {
                "title": "Affiliate Marketing",
                "description": "Setting up and managing affiliate programs to drive sales through affiliate partnerships."
              },
              {
                "title": "E-commerce Marketing",
                "description": "Strategies for promoting and selling products online."
              },
              {
                "title": "Mobile Marketing",
                "description": "Techniques for reaching and engaging mobile users through apps and mobile-optimized websites."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "People who want to begin a new career in digital marketing.",
              "Individuals looking to learn digital marketing from scratch.",
              "Business owners and entrepreneurs who want to promote their businesses online.",
              "Marketing professionals looking to deepen their understanding of digital marketing."
            ]
          }
        ]
      }
    },
    {
      "id": "11",
      "isActive": true,
      "cardimg": "images/courses/tiles/MeanStack.png",
      "bannerImgurl": "images/courses/banners/MeanStack.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "150 days",
      "title": "MEAN Stack",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "35000",
        "offerprice": "30000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Building full-stack web applications with Angular and Node.js.",
              "Understanding how Angular interacts with backend servers.",
              "Connecting Angular frontend with Node.js backend.",
              "Utilizing MongoDB with Mongoose for efficient data management.",
              "Using ExpressJS to streamline server-side development.",
              "Implementing optimistic updating for a better user experience."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Beginner-level knowledge of Angular is recommended, but the course provides detailed refreshers and explanations of core concepts.",
              "No advanced or expert knowledge of any of these topics is required."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "The MEAN stack is a full-stack JavaScript framework used for building dynamic web applications. It consists of MongoDB, a NoSQL database; Express.js, a web application framework for Node.js; Angular, a front-end JavaScript framework; and Node.js, a server-side JavaScript runtime environment. MEAN stack applications benefit from the flexibility of MongoDB for data storage, the simplicity of Express.js for server-side development, the power of Angular for creating dynamic user interfaces, and the scalability of Node.js for handling high loads. Together, these technologies provide a cohesive and efficient solution for developing modern, full-stack web applications."
          ]
        },
        "syllabus": [
          {
            "title": "Overview of MEAN Components",
            "contents": [
              {
                "title": "MongoDB, Express.js, Angular, Node.js",
                "description": "Understand the roles and integration of each component in the MEAN stack to build full-stack JavaScript applications."
              }
            ]
          },
          {
            "title": "MongoDB",
            "contents": [
              {
                "title": "Basics of NoSQL Databases",
                "description": "Learn the fundamental concepts of NoSQL databases, highlighting the differences from traditional SQL databases."
              },
              {
                "title": "Data Modeling",
                "description": "Understand how to design and manage data structures using collections and documents."
              },
              {
                "title": "CRUD Operations",
                "description": "Perform Create, Read, Update, and Delete operations in MongoDB."
              },
              {
                "title": "Mongoose",
                "description": "Learn how to use Mongoose, an ODM (Object Data Modeling) library, to interact with MongoDB in a Node.js application for schema definition, data validation, and query building."
              }
            ]
          },
          {
            "title": "Express.js",
            "contents": [
              {
                "title": "Installation and Setup",
                "description": "Learn how to install Express.js and initialize a basic Express server to handle requests and responses."
              },
              {
                "title": "Middleware Functions",
                "description": "Understand and use built-in, third-party, and custom middleware for tasks such as logging, parsing, and authentication."
              },
              {
                "title": "Routing",
                "description": "Define and manage routes for handling different HTTP methods and endpoints, including nested and dynamic routes."
              },
              {
                "title": "CRUD Operations",
                "description": "Create RESTful endpoints to handle Create, Read, Update, and Delete operations using HTTP methods (GET, POST, PUT, DELETE)."
              },
              {
                "title": "JSON Data Handling",
                "description": "Work with JSON data in API requests and responses, ensuring proper data."
              },
              {
                "title": "Error Handling",
                "description": "Implement error-handling middleware to manage and log errors, and send appropriate error responses to clients."
              },
              {
                "title": "JWT-based Authentication",
                "description": "Secure your application by setting up JSON Web Tokens (JWT) for user authentication and protecting routes, including implementing role-based access control."
              }
            ]
          },
          {
            "title": "Angular",
            "contents": [
              {
                "title": "Building Components",
                "description": "Create and manage Angular components."
              },
              {
                "title": "Data Binding",
                "description": "Implement one-way and two-way data binding to synchronize data between the model and the view."
              },
              {
                "title": "Directives",
                "description": "Utilize built-in and custom directives to manipulate DOM elements."
              },
              {
                "title": "Services",
                "description": "Create and inject services for data sharing and business logic across components."
              },
              {
                "title": "Routing Configuration",
                "description": "Set up and manage routes to navigate between different views and handle route parameters."
              },
              {
                "title": "Making HTTP Requests",
                "description": "Use Angular's HttpClient to communicate with backend services."
              },
              {
                "title": "Observables",
                "description": "Handle asynchronous data streams with RxJS observables."
              },
              {
                "title": "Form Handling",
                "description": "Implement template-driven and reactive forms."
              },
              {
                "title": "Validation",
                "description": "Apply form validation techniques to ensure data integrity."
              }
            ]
          },
          {
            "title": "Node.js",
            "contents": [
              {
                "title": "Overview",
                "description": "Understand the fundamentals of Node.js and its use for server-side programming."
              },
              {
                "title": "Event Loop",
                "description": "Learn about the event-driven, non-blocking I/O model of Node.js."
              },
              {
                "title": "Modules",
                "description": "Explore core and third-party modules."
              },
              {
                "title": "npm",
                "description": "Manage dependencies using npm (Node Package Manager)."
              },
              {
                "title": "Callbacks, Promises, and Async/Await",
                "description": "Handle asynchronous operations efficiently."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Individuals interested in applying their existing Angular and NodeJS knowledge.",
              "Those with a basic understanding of Angular and NodeJS who want a detailed guide on connecting both technologies.",
              "Anyone interested in building modern, full-stack applications.",
              "Students looking to practice and enhance their skills in NodeJS and Angular.",
              "Those seeking to develop a complete full-stack project.",
              "Anyone interested in learning development with Angular, TypeScript, and Socket IO.",
              "Individuals looking to improve their knowledge of web development."
            ]
          }
        ]
      }
    },
    {
      "id": "12",
      "isActive": true,
      "cardimg": "images/courses/tiles/MernStack.png",
      "bannerImgurl": "images/courses/banners/MeanStack.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "150 days",
      "title": "MERN Stack",
      "upcomingbatch": true,
      "registrationStart": "28-08-2024",
      "registrationEnd": "11-09-2024",
      "price": {
        "originalprice": "35000",
        "offerprice": "30000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand how to integrate the frontend (ReactJS) with the backend (NodeJS, Express) and database (MongoDB).",
              "Gain hands-on experience by creating a complete fullstack application.",
              "Reinforce your knowledge of ReactJS, NodeJS, Express, and MongoDB before diving into complex topics.",
              "Learn to secure your applications by adding user authentication (signup, login) and authorization to control access to resources.",
              "Integrate file upload capabilities in your ReactJS and Node/Express applications."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Learners should have a fundamental understanding of JavaScript, including variables, functions, and basic syntax.",
              "A basic grasp of web development concepts such as HTML, CSS, and web architecture will be helpful."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "The MERN stack, comprising MongoDB, Express.js, React.js, and Node.js, is a powerful combination of technologies for building modern web applications. MongoDB, a NoSQL database, provides flexibility and scalability for data storage. Express.js is a minimalist web framework for Node.js, enabling efficient server-side development and API creation. React.js, a front-end library offers a component-based approach for building interactive user interfaces. Node.js serves as the runtime environment for server-side JavaScript execution, facilitating seamless communication between the front and back ends."
          ]
        },
        "syllabus": [
          {
            "title": "MongoDB",
            "contents": [
              {
                "title": "Basics of NoSQL Databases",
                "description": "Introduction to MongoDB as a flexible and scalable NoSQL database solution."
              },
              {
                "title": "CRUD Operations",
                "description": "Learn to perform Create, Read, Update, and Delete operations on MongoDB documents."
              },
              {
                "title": "Data Modeling",
                "description": "Understand the concept of collections and documents and design efficient data models."
              },
              {
                "title": "Mongoose Integration",
                "description": "Use Mongoose, an ODM (Object Data Modeling) library, to interact with MongoDB in Node.js applications."
              }
            ]
          },
          {
            "title": "Express.js",
            "contents": [
              {
                "title": "Setting up Express.js",
                "description": "Initialize and configure Express.js to create a web server for handling HTTP requests."
              },
              {
                "title": "Middleware",
                "description": "Implement middleware for handling request/response pipelines and enhancing functionality."
              },
              {
                "title": "Routing",
                "description": "Define routes to handle different endpoints and HTTP methods."
              },
              {
                "title": "Building APIs",
                "description": "Use Express.js to create RESTful APIs for communication between the client and server."
              }
            ]
          },
          {
            "title": "React.js",
            "contents": [
              {
                "title": "Introduction to React.js",
                "description": "Understand the fundamentals of React.js, including components, JSX syntax, and state management."
              },
              {
                "title": "Component-based Architecture",
                "description": "Learn to build reusable and modular UI components for building dynamic user interfaces."
              },
              {
                "title": "State Management",
                "description": "Implement state management techniques using React's built-in state and props system."
              },
              {
                "title": "React Hooks",
                "description": "Explore React Hooks for managing stateful logic and side effects in functional components."
              }
            ]
          },
          {
            "title": "Node.js",
            "contents": [
              {
                "title": "Introduction to Node.js",
                "description": "Overview of Node.js as a runtime environment for server-side JavaScript execution."
              },
              {
                "title": "Event-driven Architecture",
                "description": "Understand the event-driven, non-blocking I/O model of Node.js."
              },
              {
                "title": "Node.js Modules",
                "description": "Explore core and third-party modules for building scalable and efficient server-side applications."
              },
              {
                "title": "Asynchronous Programming",
                "description": "Learn asynchronous programming patterns using callbacks, promises, and async/await."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Developers who are familiar with React and Express Fundamentals and now want to learn how to build and deploy MERN application from scratch.",
              "Developers aiming to expand their toolkit with authentication, Redux, and advanced MongoDB usage."
            ]
          }
        ]
      }
    },
    {
      "id": "14",
      "isActive": true,
      "cardimg": "images/courses/tiles/CloudComputing.png",
      "bannerImgurl": "images/courses/banners/CloudComputing.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Cloud Computing",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "22500",
        "offerprice": "18500",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Fundamental concepts of cloud computing designed for absolute beginners.",
              "Basics of Amazon Web Services (AWS), the leading cloud computing platform.",
              "Understanding of fundamental cloud systems including storage, networking, and compute.",
              "Hands-on skills using core Amazon Web Services (AWS) services."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary.",
              "No IT prerequisites required"
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Cloud computing is a revolutionary technology that allows users to access and store data and applications over the internet instead of on local servers or personal devices. By leveraging remote servers hosted on the internet, cloud computing provides scalable and flexible resources on-demand, enabling businesses and individuals to efficiently manage and utilize computing resources without the need for extensive infrastructure investments."
          ]
        },
        "syllabus": [
          {
            "title": "Course Content",
            "contents": [
              {
                "title": "Amazon Web Services Fundamentals",
                "description": "Introduction to AWS, its services, and core concepts."
              },
              {
                "title": "AWS Authentication and Access Control",
                "description": "Understanding authentication mechanisms and access control methods in AWS."
              },
              {
                "title": "Amazon EC2, Auto Scaling, and Load Balancing",
                "description": "Exploring Amazon Elastic Compute Cloud (EC2), auto-scaling configurations, and load balancing techniques for scalability and high availability."
              },
              {
                "title": "Amazon Virtual Private Cloud (VPC)",
                "description": "Overview of AWS Virtual Private Cloud (VPC) for networking isolation and security."
              },
              {
                "title": "AWS Storage Services",
                "description": "Learning about various AWS storage services such as Amazon S3, EBS, and Glacier for data storage and retrieval."
              },
              {
                "title": "AWS Database Services",
                "description": "Introduction to AWS database services including Amazon RDS, DynamoDB, and Redshift for managing structured and unstructured data."
              },
              {
                "title": "Automation and DevOps on AWS",
                "description": "Implementing automation and DevOps practices using AWS services like CloudFormation, OpsWorks, and CodeDeploy."
              },
              {
                "title": "DNS, Caching, and Performance Optimization",
                "description": "Understanding Domain Name System (DNS), caching mechanisms, and performance optimization techniques on AWS."
              },
              {
                "title": "Containers and Serverless Computing",
                "description": "Exploring containerization with AWS ECS, EKS, and serverless computing using AWS Lambda for efficient resource utilization."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Anyone keen to learn about cloud computing.",
              "Professionals exploring cloud computing services.",
              "Individuals interested in understanding Amazon Web Services (AWS).",
              "Aspiring developers wanting to build applications on AWS.",
              "Students keen to learn fundamental cloud computing concepts"
            ]
          }
        ]
      }
    },
    {
      "id": "15",
      "isActive": false,
      "cardimg": "images/courses/tiles/FullStack.png",
      "bannerImgurl": "images/courses/banners/FullStack.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "150 days",
      "title": "Full Stack",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "35000",
        "offerprice": "30000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Build dynamic, responsive user interfaces using modern JavaScript frameworks.",
              "Develop server-side applications, manage databases, and create APIs.",
              "Design and administer scalable SQL and NoSQL databases.",
              "Implement CI/CD pipelines, containerize applications, and deploy on cloud platforms.",
              "Integrate front-end and back-end components to create cohesive, scalable applications."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Access to a computer with internet for coding and resources.",
              "Willingness to engage in exercises, projects, and peer collaboration."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Full Stack Development involves building both the front-end and back-end of web applications. It encompasses creating dynamic user interfaces with HTML, CSS, and JavaScript frameworks, and developing server-side logic with technologies like Node.js, Python, or Java. It also includes database management and deployment practices, providing a comprehensive skill set for developing complete, scalable web solutions."
          ]
        },
        "syllabus": [
          {
            "title": "FullStack",
            "contents": [
              {
                "title": "Front-End Development",
                "description": "HTML, CSS, JavaScript,  React.js or Angular"
              },
              {
                "title": "Back-End Development",
                "description": "Node.js, Express.js, Python, or Java."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "16",
      "isActive": true,
      "cardimg": "images/courses/tiles/CppProgramming.png",
      "bannerImgurl": "images/courses/banners/C++.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "30 days",
      "title": "C++ Programming",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "6000",
        "offerprice": "5000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Learn to program using C++, one of the most powerful programming languages today.",
              "Explore the components of a C++ program in detail.",
              "Master decision-making, loops, strings, and arrays in C++ programming.",
              "Understand object-oriented programming (OOP) concepts in C++ with examples.",
              "Learn about objects, classes, operator overloading, inheritance, and pointers in C++ programming.",
              "Dive into virtual functions, streams, and file handling in C++, and learn how to develop an application through a project.",
              "Explore the Standard Template Library (STL) in detail."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              " Only Computer is Required We'll Start From Basics.",
              "No Prior Programming knowledge is required."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "C++ is a powerful, high-performance programming language known for its use in system/software development, game programming, and real-time simulations. It supports object-oriented, procedural, and generic programming, making it versatile for a wide range of applications."
          ]
        },
        "syllabus": [
          {
            "title": "C++",
            "contents": [
              {
                "title": "C++ vs. C",
                "description": " Understand the key differences between the languages."
              },
              {
                "title": "Function Overloading & Optional Parameters",
                "description": " Use functions with the same name but different parameters and implement default parameters."
              },
              {
                "title": "Reference Variables & Operator Overloading",
                "description": " Utilize references instead of pointers and redefine operators for custom types."
              },
              {
                "title": "Console I/O Basics & Constant Pointers",
                "description": "Learn basic input/output operations and about pointers that cannot change their memory location."
              },
              {
                "title": "OOP Principles",
                "description": "Grasp core principles, including classes, object lifecycle, and data members."
              },
              {
                "title": "Advanced OOP Concepts",
                "description": "Learn about constructors, destructors, static members, friend classes, and pointers."
              },
              {
                "title": "Inheritance & Access Specifiers",
                "description": " Understand inheritance concepts, including public, private, and protected access specifiers, and various types of inheritance."
              },
              {
                "title": "Constructors & Function Overriding",
                "description": "Learn about base and derived class constructors, and how to override functions in derived classes."
              },
              {
                "title": "Polymorphism & Pure Virtual Functions",
                "description": "Explore dynamic method binding, polymorphism, and abstract classes with pure virtual functions."
              },
              {
                "title": "Namespaces & Virtual Base Class",
                "description": " Use namespaces to avoid name conflicts and manage multiple inheritance with virtual base classes."
              },
              {
                "title": "Exception Handling Basics",
                "description": " Learn the fundamentals of exception handling, including the use of try and catch blocks, the throw statement, and predefined exceptions."
              },
              {
                "title": "Custom Exceptions",
                "description": "Discover the benefits of exception handling for robust programs and how to create custom exception classes."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              " For Beginner , For College Students , For Developers who want to Advance in C++",
              " Anyone looking to increase career options by learning one the most in-demand programming languages."
            ]
          }
        ]
      }
    },
    {
      "id": "17",
      "isActive": true,
      "cardimg": "images/courses/tiles/CProgramming.png",
      "bannerImgurl": "images/courses/banners/C.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "30 days",
      "title": "C Programming",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "6000",
        "offerprice": "5000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand fundamental syntax and concepts of the C programming language, including variables, data types, operators, control structures (loops and conditionals), functions, and basic I/O operations.",
              "Learn how to write high-quality code.",
              "Understanding how memory is managed in C and mastering the use of pointers is crucial.",
              "Understand memory management and pointers to utilize memory efficiently and prevent errors.",
              "Learn basics like variables, data types, operators, control structures, functions, and basic I/O operations.",
              "Develop skills for clean, readable, and maintainable code following best practices.",
              "Understand memory management and pointers to utilize memory efficiently and prevent errors.",
              "Structure code into reusable functions and modules for better readability, maintainability, and scalability."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No programming experience, all concepts taught in this class!"
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "C is a powerful and versatile programming language renowned for its efficiency, flexibility, and portability. Originally developed in the early 1970s, C has since become one of the most widely used programming languages, influencing the design of numerous other languages. Its syntax is concise and expressive, allowing for efficient manipulation of low-level system resources while also providing high-level constructs for structured programming."
          ]
        },
        "syllabus": [
          {
            "title": "C Programming",
            "contents": [
              {
                "title": "Introduction and First Program",
                "description": "Covers the history of C language and introduces the basic program, which is typically the first program learners write in any language."
              },
              {
                "title": "Variables and Data Types",
                "description": "Explains identifiers, variables, data types, and constants in C programming."
              },
              {
                "title": "Operators and Expressions",
                "description": "Discusses arithmetic, relational, logical, and bitwise operators, along with expressions."
              },
              {
                "title": "Control Flow Statements",
                "description": "Various control flow statements like if, switch, loops (while, do-while, for), as well as special cases, break, and continue statements."
              },
              {
                "title": "Working with Functions",
                "description": "Introduces functions, scope of variables, storage classes, pass-by value/reference, and recursion."
              },
              {
                "title": "Working with Arrays",
                "description": "Discusses arrays, their declaration, initialization, usage in functions, and multi-dimensional arrays."
              },
              {
                "title": "Pointers",
                "description": "Focuses on pointers, including their usage as function parameters, pointer arithmetic, relationship with arrays, and function pointers."
              },
              {
                "title": "File Handling",
                "description": "Introduces file streams, writing and reading characters, text and binary file handling, and structure serialization."
              },
              {
                "title": "String Handling",
                "description": "Explores string manipulation functions and operations in C."
              },
              {
                "title": "Structures and Unions",
                "description": "Introduces structured data types, their declaration, initialization, and usage."
              },
              {
                "title": "Command Line Arguments",
                "description": "Discusses how to work with command-line arguments passed to C programs."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Anyone looking to learn how to program in the C language"
            ]
          }
        ]
      }
    },
    {
      "id": "18",
      "isActive": false,
      "cardimg": "images/courses/tiles/AdvanceSelenium.png",
      "bannerImgurl": "images/courses/banners/AdvanceSelenium.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "30 days",
      "title": "Advance Selenium",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "16000",
        "offerprice": "14000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "19",
      "isActive": false,
      "cardimg": "images/courses/tiles/DataAnalytics.png",
      "bannerImgurl": "images/courses/banners/DataAnalytics.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "150 days",
      "title": "Data Analytics",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "45000",
        "offerprice": "41000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "20",
      "isActive": true,
      "cardimg": "images/courses/tiles/JAVA.png",
      "bannerImgurl": "images/courses/banners/JavaDevelopment.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "90 days",
      "title": "Java",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "32000",
        "offerprice": "26999",
        "discount": false
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Master essential Java concepts including OOP principles, keywords, operators, objects, classes, methods, constructors, control flow statements, loops, inheritance, and interfaces.",
              "Develop skills in exception handling, wrapper classes, collections framework, enums, and Date and Time API.",
              "Learn advanced Java topics such as generics, functional programming, lambda expressions, functional interfaces, method references, streams API, and multi-threading."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "No prior programming experience required, but familiarity with basic programming concepts will be beneficial.",
              "A computer with internet access and a willingness to learn and practice."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Java is a versatile, high-level programming language known for its simplicity, reliability, and cross-platform capabilities. Designed to be object-oriented, Java allows developers to create robust, scalable applications with the principle of 'write once, run anywhere,' thanks to the Java Virtual Machine (JVM). Widely used in web development, enterprise solutions, and mobile applications (especially Android), Java benefits from a rich set of libraries, powerful frameworks, and strong community support, making it a popular choice for addressing complex programming challenges."
          ]
        },
        "syllabus": [
          {
            "title": "Java",
            "contents": [
              {
                "title": "Java",
                "description": "Introduction, Java Basics, Intermediate Concepts, Advanced Concepts, Concurrency, JVM Internals, Networking and Java I/O."
              },
              {
                "title": "Hibernate Framework (3.x) Highlights",
                "description": "Overview and Setup, Mapping, Session Management and Advanced Features."
              },
              {
                "title": "Spring Framework (3.x)",
                "description": "Introduction and Setup, Core Container, Spring MVC and Data Access and Security."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "Beginners aspiring to learn Java programming.",
              "Experienced developers looking to expand their Java skills.",
              "Students and professionals seeking to advance their careers in software development."
            ]
          }
        ]
      }
    },
    {
      "id": "21",
      "isActive": false,
      "cardimg": "images/courses/tiles/TallyPrime.png",
      "bannerImgurl": "images/courses/banners/TallyPrime.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "45 days",
      "title": "Tally Prime",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "5500",
        "offerprice": "5000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    },
    {
      "id": "22",
      "isActive": false,
      "cardimg": "images/courses/tiles/UIDevelopment.png",
      "bannerImgurl": "images/courses/banners/UiDevelopment.jpg",
      "offerImgurl": "images/courses/tiles/DefaultOfferCoverImage.png",
      "month": "45 days",
      "title": "UI Development",
      "upcomingbatch": false,
      "registrationStart": "12-07-2024",
      "registrationEnd": "17-07-2024",
      "price": {
        "originalprice": "15000",
        "offerprice": "12000",
        "discount": true
      },
      "courseDetail": {
        "objective": [
          {
            "contents": [
              "Understand the correct syntax of Python language elements like indentation, loops, conditionals, and functions.",
              "Learn how to work with various data types and structures, including strings, lists, dictionaries, and tuples, enabling you to manipulate and analyze data effectively.",
              "Develop Python Modules to Create Re-Usable Code.",
              "Learn how to read from and write to files, enabling you to interact with external data sources and persist information across sessions.",
              "You will learn Beautiful Soup, Request, Pandas, NumPy, Scikit Learn, and Matplotlib."
            ]
          }
        ],
        "requirements": [
          {
            "contents": [
              "Absolutely no prior experience necessary."
            ]
          }
        ],
        "courseDescription": {
          "description": [
            "Python is a versatile and powerful programming language known for its simplicity and readability. It is widely used in various domains such as web development, data analysis, artificial intelligence, scientific computing, and more. With its extensive standard library and active community support, Python is an excellent choice for both beginners and experienced developers."
          ]
        },
        "syllabus": [
          {
            "title": "Python",
            "contents": [
              {
                "title": "Overview of Python",
                "description": "Introduction to Python, its features, and how it works internally."
              },
              {
                "title": "Variables and Keywords",
                "description": "Understanding variables, naming conventions, and Python keywords."
              },
              {
                "title": "Python Data Types",
                "description": "Exploring built-in data types like numeric, string, list, tuple, dictionary, and set."
              },
              {
                "title": "Operators and their Types",
                "description": " Overview of operators in Python including arithmetic, comparison, logical, and bitwise."
              },
              {
                "title": "Control Flow",
                "description": " Conditional statements (if, elif) for decision-making, and loops (for loop, while loop) for iteration."
              },
              {
                "title": "Functions",
                "description": "Introduction to defining and calling functions, function arguments, inner calling techniques, and lambda functions."
              },
              {
                "title": "Recursion Function",
                "description": "Understanding recursion and implementing recursive functions."
              },
              {
                "title": "Dynamic Input in Lists",
                "description": "Handling dynamic input in lists using list comprehension and input() function."
              },
              {
                "title": "Object-Oriented Programming",
                "description": "Introduction to OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation."
              },
              {
                "title": "Decorators in Python",
                "description": "Understanding decorators to add functionality to functions and methods."
              },
              {
                "title": "Multiprocessing and Multithreading",
                "description": "Working with multiple processes using the multiprocessing module and multithreading concepts using the threading module."
              },
              {
                "title": "File Handling",
                "description": "Reading from and writing to files in Python."
              },
              {
                "title": "Modules and Packages",
                "description": "Understanding modules and packages for code organization and reuse"
              },
              {
                "title": "Automation",
                "description": "Automating tasks using scripting and scheduling."
              }
            ]
          }
        ],
        "whoThisCourseIsFor": [
          {
            "contents": [
              "New to programming, seeking to learn their first language due to Python's simplicity and readability.",
              "Programmers incorporating Python into web development, automation, or software projects.",
              "Students and academics using Python in their curriculum or research.",
              "Non-programmers (e.g., finance, marketing, engineering) automating tasks or conducting data analysis with Python"
            ]
          }
        ]
      }
    }
  ],
  "feedback": [
    {
      "img": "images/google-image.png",
      "name": "Manisha Subhash Mahale",
      "color": "blue",
      "comment": "I recently completed my web development course at Hematite Institute,and it was an exceptional experience from start to finish.The hands pn projects ,led by industry experts will give edge in todays tech world.I highly recommend Hematite Institute to anyone looking to learn web development.Thank you to the entire team for a fantastic learning journey.",
      "googleLink": "https://g.co/kgs/e15762u"
    },
    {
      "img": "images/google-image.png",
      "name": "Afroj Khan",
      "color": "blue",
      "comment": "Hematile Infotech Pvt Ltd. It's a damn good instituted for IT classes excellent techers and very good management. All teachers are very qualified and talented. So if you want to take admission in it classes i recommended you come in Hematile and make your dreams come true.",
      "googleLink": "https://g.co/kgs/8UVYtuu"
    },
    {
      "img": "images/google-image.png",
      "name": "Gulshan Khan",
      "color": "blue",
      "comment": "One of the good place to learn Digital marketing which can definitely enhance your skills and personality to which you can definitely think about career what you really want in your life....and guys initiave taken by student is very important to anything in the world, so learn enhance and you are ready.Overall good experience guys for everything and very good mentorship.",
      "googleLink": "https://g.co/kgs/7ZcMuyZ"
    },
    {
      "img": "images/google-image.png",
      "name": "santosh Khandekar",
      "color": "blue",
      "comment": "I Would like To tell A lot of Thanks to a my hematite institute teacher...Their  teaching way Was Very understandable..A behaviour of teachers with students its very good...I was completed my digital marketing course in this institute.. and I saw of my  lot of Growths and Improvement of marketing and business field was done here. Thank You So Much...!",
      "googleLink": "https://g.co/kgs/zcozUSp"
    },
    {
      "img": "images/google-image.png",
      "name": "Sagar Aware",
      "color": "blue",
      "comment": "Hematite Institute offers unparalleled opportunities for career growth and development. Through their industrial training program, I've gained invaluable technical skills and hands-on experience with live projects, setting me up for success in the job market. Under the guidance of Mr. Panchashil Wankhede Sir, whose teaching style is enriched with real-life examples, I've honed my abilities and confidence in the IT field. The supportive environment and friendly trainers at Hematite ensure that all doubts are addressed without judgment, making it the ideal place to thrive and excel. Grateful for the exceptional training provided by Hematite, I confidently recommend it as the premier destination for those looking to embark on a rewarding career journey in IT.",
      "googleLink": "https://g.co/kgs/CbtF5fs"
    },
    {
      "img": "images/google-image.png",
      "name": "Rahul Pawar",
      "color": "blue",
      "comment": "I recently completed my web development course at Hematite Institute,and it was an exceptional experience from start to finish.The hands pn projects ,led by industry experts will give edge in todays tech world",
      "googleLink": "https://maps.app.goo.gl/nCUWdddDsR79raxa9"
    },
    {
      "img": "images/google-image.png",
      "name": "Arpita Teldhune",
      "color": "blue",
      "comment": "This institute is the best platform to learn and grow in your career. Here I got Industrial training in which I had learn many new things in technical field they had also assign me live project with is helpful for getting better job opportunity. They also had trained me for interviews. Mr. Panchashil Wankhede Sir is the best trainer in Hematite who teaches with real life example and also provide task to perform which are so beneficial for me... I'm so thankful to hematite for provide me best training which is making me perfect in IT field. All trainer's over here as so friendly with Students. They will clear your all doubts without judging you.",
      "googleLink": "https://maps.app.goo.gl/KDsfqAZqMDishdxr6"
    },
    {
      "img": "images/google-image.png",
      "name": "Soyal Bhosle",
      "color": "blue",
      "comment": "I am having a great pleasure to work as a Frontend Developer intern in hematite Infotech IT Training & Placement Institute.",
      "googleLink": "https://maps.app.goo.gl/bvzvrfEbDeQiDhuq6"
    },
    {
      "img": "images/google-image.png",
      "name": "Mangesh Ohol",
      "color": "blue",
      "comment": "I have been studying in hematite infotech since five months and i would love to tell you that this is one of the best institute in pune.The best thing about this institute is they focus on practical learning and the enviroment is friendly in classes. if you don't have laptops then you don't have to worry about it cause they provides laptops for practice. one more thing, if you want to learn frontend then i will recommend you to learn it from panchashil sir.and for java mayuri ma'am is best. area for improvement: they should take more communication session.",
      "googleLink": "https://g.co/kgs/D5VEHan"
    },
    {
      "img": "images/google-image.png",
      "name": "Samiksha Balwatkar",
      "color": "blue",
      "comment": "The programming class is very easy to understand . Concepts are very clear nice faculty, effective teaching, and good devices have helped me in learning c programming",
      "googleLink": "https://maps.app.goo.gl/id5D8BKeDAg96AWP9"
    },
    {
      "img": "images/google-image.png",
      "name": "Velina Fernandes",
      "color": "blue",
      "comment": "It was a very good experience to work in Hematite . The staff here are very supportive and helpful.",
      "googleLink": "https://maps.app.goo.gl/8pyuPEGU1uXgriew8"
    },
    {
      "img": "images/google-image.png",
      "name": "Gaurav Kulkarni",
      "color": "blue",
      "comment": "It was a great experience during the course. Teaching was very good and teachers cleared all then doubts. Extra things and shortcuts were also taught",
      "googleLink": "https://maps.app.goo.gl/e73zqfkdPyrJFL2P7"
    },
    {
      "img": "images/google-image.png",
      "name": "Abhinav Nair",
      "color": "blue",
      "comment": "It was a great experience working with the hematite group. The team of Rahul Sir , Parag sir and Kasturi Ma'am is amazing and they helped in smooth functioning of the programme.",
      "googleLink": "https://maps.app.goo.gl/BJLx6bb4CmGFhDWBA"
    },
    {
      "img": "images/google-image.png",
      "name": "Pratik Masalkar",
      "color": "blue",
      "comment": "Trainers had good practical knowledge,and assigning task which is improve our logical knowledge. we had done individual project which was assigned by Hematite. Thanks for all support",
      "googleLink": "https://maps.app.goo.gl/ub8P73rVh5LzPEW97"
    },
    {
      "img": "images/google-image.png",
      "name": "Jadhav Sujeet",
      "color": "blue",
      "comment": "The session was great, it was an meaningfull and great time for learning new things. We all was inspired by the Sir and got there experience in various IT field.",
      "googleLink": "https://maps.app.goo.gl/WVgvaaGo742YHjhv9"
    },
    {
      "img": "images/google-image.png",
      "name": "Gulshan Khan",
      "color": "blue",
      "comment": "One of the good place to learn Digital marketing which can definitely enhance your skills and personality to which you can definitely think about career what you really want in your life....and guys initiave taken by student is very important to anything in the world, so learn enhance and you are ready. Overall good experience guys for everything and very good mentorship",
      "googleLink": "https://maps.app.goo.gl/e73zqfkdPyrJFL2P7"
    },
    {
      "img": "images/google-image.png",
      "name": "santosh Khandekar",
      "color": "blue",
      "comment": "I Would like To tell A lot of Thanks to a my hematite institute teacher...Their  teaching way Was Very understandable..A behaviour of teachers with students its very good...I was completed my digital marketing course in this institute.. and I saw of my  lot of Growths and Improvement of marketing and business field was done here. Thank You So Much...!",
      "googleLink": "https://maps.app.goo.gl/DEiBLA4hANGZQvnU9"
    },
    {
      "img": "images/google-image.png",
      "name": "Hirendra Gurnani",
      "color": "blue",
      "comment": "Interning here is a fun experience. Factors such as Great work environment and friendly colleagues, are a great motivator.",
      "googleLink": "https://maps.app.goo.gl/P4WNCeV5L9pxTVU6A"
    },
    {
      "img": "images/google-image.png",
      "name": "soyaib ansari",
      "color": "blue",
      "comment": "Thanks a lot to hematiti institution...learned a lot...good for IT students.A very big thanks to Rahul sir too.",
      "googleLink": "https://maps.app.goo.gl/SXsf3kYb2GzpnuVD8"
    },
    {
      "img": "images/google-image.png",
      "name": "Shravan Shinde",
      "color": "blue",
      "comment": "I am really thankful that I chosen hematitr infotech . The teaching staff is very knowledgeable and highly updated with the knowledge. The syllabus and topics are taught very perfectly and carefully. …",
      "googleLink": "https://maps.app.goo.gl/FPR1noRf6MAhdy9n7"
    },
    {
      "img": "images/google-image.png",
      "name": "ANKITA SONAR",
      "color": "blue",
      "comment": "i came first upon visit this class, i am uncomfortable then digital marketing sir helps me a lot for i will be more better understand, staff and teachers are very good and helpful ...and their environment are very friendly...",
      "googleLink": "https://maps.app.goo.gl/beammMowjbQZgxro8"
    },
    {
      "img": "images/google-image.png",
      "name": "Ram Shinde",
      "color": "blue",
      "comment": "I found this academy is best. I have good experience at hematite infotech . The faculties are knowledgeable and nice. They always provide us with different opportunities. I learned many things here",
      "googleLink": "https://maps.app.goo.gl/beammMowjbQZgxro8"
    }
  ],
  "aboutUsHeadings": [
    {
      "heading2": "Our Mission, Vision and Values",
      "heading3": "Upcoming Events",
      "heading5": "Our Infrastructure"
    }
  ],
  "aboutPage": [
    {
      "heading1": "Knowledge is power, Information is liberating",
      "description": [
        "In addition to IT education, Hematite Infotech offers IT training, consulting, corporate training, application development, and digital marketing services. Our young team of technology experts is committed to providing the best solutions to our customers. We specialize in equipping workforces with the skills and knowledge needed to excel in today’s dynamic business landscape. By delivering comprehensive, tailored training solutions across various industries, we empower individuals and organizations to reach their full potential. Our commitment to excellence and passion for learning drive us to continuously upgrade our performance and deliver top-notch training programs that achieve significant results.",
        "Our tagline, 'Success Redefined,' emphasizes a modern approach to achievement in the IT world. It highlights that success isn't just about mastering skills or landing a job but also about innovation, adaptability, and making a meaningful impact in the industry. Our institute aims to reshape the traditional view of success by focusing on continuous learning, real-world problem-solving, and nurturing leaders who can redefine the future of technology."
      ],
      "description1": "Hematite Infotech Pvt. Ltd. is an organization dedicated to the spread of IT Education. Ever since its inception in 2017, the Academy has fulfilled its goals of providing Quality Computer Education, transforming aspiring students into tomorrow’s IT professionals. Hematite Infotech has continuously upgraded its performance, creating a focus on advanced information technologies, high-end academics, and training.",
      "heading4": "You Want Courses That Get You a Job?"
    }
  ],
  "aboutUsImages": [
    {
      "imageUrl": "images/aboutus/about_section_img.jpg",
      "eventImgUrl": "images/aboutus/upcomingevent.jpg",
      "image_Url": "images/aboutus/aboutus-3 (1).webp"
    }
  ],
  "benchmarkIcons": [
    {
      "imgIconUrl1": "images/aboutus/btrainedstudents.png",
      "imgIconUrl2": "images/aboutus/bdiploma.png",
      "imgIconUrl3": "images/aboutus/bexperience.png",
      "imgIconUrl4": "images/aboutus/bexperts.png"
    }
  ],
  "infrastructure": [
    {
      "imageUrl": "images/aboutus/infrastructure_3.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_4.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_8.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_9.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_11.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_12.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_13.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_14.jpg"
    },
    {
      "imageUrl": "images/aboutus/infrastructure_20.jpeg"
    }
  ],
  "aboutAimDetails": [
    {
      "bgcolour": "#eaf8f6",
      "iconImg": "images/aboutus/mission.png",
      "title": "Mission",
      "description": "To provide the best quality IT training to our clients with the understanding of industry requirements , the latest technology, and customer satisfaction"
    },
    {
      "bgcolour": "#fff3ee",
      "iconImg": "images/aboutus/purpose.png",
      "title": "Vision",
      "description": "To transform and empower the clients using our effective and excellent training techniques , and to become a leader in the training industry"
    },
    {
      "bgcolour": "#fff1f1",
      "iconImg": "images/aboutus/values.png",
      "title": "Values",
      "description": "Integrity,Efficiency, Responsibility, and Continuous Growth"
    }
  ],
  "Counters": [
    {
      "icon": "images/home/lecture-room.png",
      "title": "Student Trained",
      "value": 10000
    },
    {
      "icon": "images/home/colleges.png",
      "title": "Colleges",
      "value": 15
    },
    {
      "icon": "images/home/trainer.png",
      "title": "Expert Instructors",
      "value": 25
    },
    {
      "icon": "images/home/placement.png",
      "title": "Placement",
      "value": 1000
    }
  ],
  "placementHighlightCounter": [
    {
      "companyVisited": "420+",
      "noCriteriaCompanies": "110+",
      "calls": "50+"
    }
  ],
  "placedstudents": [
    {
      "id": "1",
      "img": "images/placement/Aakash.png",
      "name": "Aakash Jagade"
    },
    {
      "id": "2",
      "img": "images/placement/Aditya.png",
      "name": "Aditya"
    },
    {
      "id": "3",
      "img": "images/placement/Akshay_K.png",
      "name": "Akshay K"
    },
    {
      "id": "4",
      "img": "images/placement/Akshay_Limkar.png",
      "name": "Akshay_Limkar"
    },
    {
      "id": "5",
      "img": "images/placement/Amit_Bhanwase.png",
      "name": "Amit_Bhanwase"
    },
    {
      "id": "6",
      "img": "images/placement/Amruta_S.png",
      "name": "Amruta_S"
    },
    {
      "id": "7",
      "img": "images/placement/Aniket_Waghole.png",
      "name": "Aniket_Waghole"
    },
    {
      "id": "8",
      "img": "images/placement/Anmol_Chawre.png",
      "name": "Anmol_Chawre"
    },
    {
      "id": "9",
      "img": "images/placement/Chetan.jpeg",
      "name": "Chetan"
    },
    {
      "id": "10",
      "img": "images/placement/Darshan.jpeg",
      "name": "Vishal Galphade"
    },
    {
      "id": "11",
      "img": "images/placement/Devendra.jpeg",
      "name": "Devendra"
    },
    {
      "id": "12",
      "img": "images/placement/Dhanshree.jpeg",
      "name": "Dhanshree"
    },
    {
      "id": "12",
      "img": "images/placement/Eshwari_Bihade.png",
      "name": "Eshwari_Bihade"
    },
    {
      "id": "13",
      "img": "images/placement/Gaurav_Alhat.png",
      "name": "Gaurav_Alhat"
    },
    {
      "id": "14",
      "img": "images/placement/Gaurav_Gadilohar.png",
      "name": "Gaurav_Gadilohar"
    },
    {
      "id": "15",
      "img": "images/placement/Gauri_D.jpeg",
      "name": "Gauri_D"
    },
    {
      "id": "16",
      "img": "images/placement/Kailas.jpeg",
      "name": "Kailas"
    },
    {
      "id": "17",
      "img": "images/placement/Kartiki.png",
      "name": "Kartiki"
    },
    {
      "id": "18",
      "img": "images/placement/Khushali.png",
      "name": "Khushali"
    },
    {
      "id": "19",
      "img": "images/placement/Komal_G.jpeg",
      "name": "Komal_G"
    },
    {
      "id": "20",
      "img": "images/placement/Kushal.png",
      "name": "Kushal"
    },
    {
      "id": "21",
      "img": "images/placement/Manisha.png",
      "name": "Manisha"
    },
    {
      "id": "22",
      "img": "images/placement/Mobin_Syed.png",
      "name": "Mobin_Syed"
    },
    {
      "id": "23",
      "img": "images/placement/Neha_Sonawane.png",
      "name": "Neha_Sonawane"
    },
    {
      "id": "24",
      "img": "images/placement/Nikhil_G.png",
      "name": "Nikhil_G"
    },
    {
      "id": "25",
      "img": "images/placement//Nikhil_Pawar.png",
      "name": "Nikhil_Pawar"
    },
    {
      "id": "26",
      "img": "images/placement/Nikita_W.jpeg",
      "name": "Nikita_W"
    },
    {
      "id": "27",
      "img": "images/placement/Omkar_Abhang.png",
      "name": "Omkar_Abhang"
    },
    {
      "id": "28",
      "img": "images/placement/Pallavi_Dandage.png",
      "name": "Pallavi_Dandage"
    },
    {
      "id": "29",
      "img": "images/placement/Pooja_D.png",
      "name": "Pooja_D"
    },
    {
      "id": "30",
      "img": "images/placement/Pooja_Fulsundar.png",
      "name": "Pooja_Fulsundar"
    },
    {
      "id": "31",
      "img": "images/placement/Poonam.jpeg",
      "name": "Poonam"
    },
    {
      "id": "32",
      "img": "images/placement/Pornima_Divekar.png",
      "name": "Pornima_Divekar"
    },
    {
      "id": "33",
      "img": "images/placement/Pragati_Bhande.png",
      "name": "Pragati_Bhande"
    },
    {
      "id": "34",
      "img": "images/placement/Pragati_Kakade.png",
      "name": "Pragati_Kakade"
    },
    {
      "id": "35",
      "img": "images/placement/Pranav_P.png",
      "name": "Pranav_P"
    },
    {
      "id": "36",
      "img": "images/placement/Priyanka_k.jpeg",
      "name": "Priyanka_k"
    },
    {
      "id": "37",
      "img": "images/placement/Priyanka.png",
      "name": "Priyanka"
    },
    {
      "id": "38",
      "img": "images/placement/Pushpak_K.jpeg",
      "name": "Pushpak_K"
    },
    {
      "id": "39",
      "img": "images/placement/Ravi_D.png",
      "name": "Ravi_D"
    },
    {
      "id": "40",
      "img": "images/placement/Ravi_M.png",
      "name": "Ravi_M"
    },
    {
      "id": "41",
      "img": "images/placement/Rupesh_B.png",
      "name": "Rupesh_B"
    },
    {
      "id": "42",
      "img": "images/placement/Rutuja_M.jpeg",
      "name": "Rutuja_M"
    },
    {
      "id": "43",
      "img": "images/placement/Sagar_S.png",
      "name": "Sagar_S"
    },
    {
      "id": "44",
      "img": "images/placement/Sanket.png",
      "name": "Sanket"
    },
    {
      "id": "45",
      "img": "images/placement/Shivani_mane.jpeg",
      "name": "Shivani_mane"
    },
    {
      "id": "46",
      "img": "images/placement/Amruta_S.png",
      "name": "Amruta_S"
    },
    {
      "id": "47",
      "img": "images/placement/Aniket_Waghole.png",
      "name": "Aniket_Waghole"
    },
    {
      "id": "48",
      "img": "images/placement/Shivani.jpeg",
      "name": "Shivani"
    },
    {
      "id": "49",
      "img": "images/placement/Shrutika_Davari.png",
      "name": "Shrutika_Davari"
    },
    {
      "id": "50",
      "img": "images/placement/Shubham_Kaddi.png",
      "name": "Shubham_Kaddi"
    },
    {
      "id": "1",
      "img": "images/placement/Siddhant.jpeg",
      "name": "Siddhant"
    },
    {
      "id": "52",
      "img": "images/placement/Smita.png",
      "name": "Smita"
    },
    {
      "id": "53",
      "img": "images/placement/Santoshi.jpeg",
      "name": "Santoshi"
    },
    {
      "id": "54",
      "img": "images/placement/Snehal_Kasare.png",
      "name": "Snehal_Kasare"
    },
    {
      "id": "55",
      "img": "images/placement/Sonal.jpeg",
      "name": "Sonal"
    },
    {
      "id": "56",
      "img": "images/placement/Sonali.png",
      "name": "Sonali"
    },
    {
      "id": "57",
      "img": "images/placement/Sunil.jpeg",
      "name": "Sunil"
    },
    {
      "id": "58",
      "img": "images/placement/Tejaswini.png",
      "name": "Tejaswini"
    },
    {
      "id": "59",
      "img": "images/placement/Vaibhav.png",
      "name": "Vaibhav"
    },
    {
      "id": "60",
      "img": "images/placement/Vaibhavi_Mhetre.png",
      "name": "Vaibhavi_Mhetre"
    },
    {
      "id": "61",
      "img": "images/placement/Yashwini.jpeg",
      "name": "Yashwini"
    }
  ],
  "benchmarkData": [
    {
      "iconUrl": "/images/aboutus/training.png",
      "title": "10000+",
      "subtitle": "Training Delivered"
    },
    {
      "iconUrl": "/images/aboutus/fullstack.png",
      "title": "20+",
      "subtitle": "Full Stack Batches"
    },
    {
      "iconUrl": "/images/aboutus/experience.png",
      "title": "8+",
      "subtitle": "Years of Accumulative Experience"
    },
    {
      "iconUrl": "/images/aboutus/expert.png",
      "title": "30+",
      "subtitle": "Dedicated Experts"
    }
  ],
  "footer": {
    "sloganheading": {
      "title": "ABOUT US"
    },
    "slogan": "Hematite Infotech Pvt. Ltd, represents the highest level of competence and expertise in delivering technology training along with application development through multiple learning methodologies worldwide.",
    "social": [
      {
        "name": "Instagram",
        "link": "https://www.instagram.com/hematite_infotech?igsh=ZDE3OTNnNzdjNnl4",
        "icon": "FaInstagram"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/company/hematite-infotech-pvt-ltd/mycompany/",
        "icon": "FaLinkedinIn"
      },
      {
        "name": "Facebook",
        "link": "https://www.facebook.com/hematiteinfotech/",
        "icon": "FaFacebookF"
      },
      {
        "name": "WhatsApp",
        "link": "https://wa.link/he878r",
        "icon": "IoLogoWhatsapp"
      },
      {
        "name": "YouTube",
        "link": "http://www.youtube.com/@hematiteinfotech1569",
        "icon": "FaYoutube"
      }
    ],
    "siteMap": {
      "title": "SITE MAP",
      "items": [
        {
          "name": "Home",
          "link": "/"
        },
        {
          "name": "About",
          "link": "/about-us"
        },
        {
          "name": "Services",
          "link": "/services"
        },
        {
          "name": "Courses",
          "link": "/courses"
        },
        {
          "name": "Contact",
          "link": "/contact"
        }
      ]
    },
    "headOffice": {
      "title": "HEAD OFFICE",
      "address": "2nd Floor, Mathura Nagar Housing Society, Near Janseva Sahakari Bank Chandan Nagar, Kharadi, Pune - 411014.",
      "email": "contact@hematitecorp.com",
      "phone": "+91 - 8263926309 / 8999639478"
    },
    "subheading": "Web Design & Development by Hematite Infotech Pvt. Ltd."
  }
}